voltvirtuoso/SerialInterfaceHandler/src/ESP32_SIH.cpp
/**
 * @file ESP32_SIH.cpp
 * @brief ESP32 Serial Interface Handler - Core Implementation
 * 
 * This implementation file contains all method definitions for the ESP32_SIH
 * system classes. It provides the complete functionality for WiFi management,
 * NVS storage operations, serial interface handling, menu system navigation,
 * and system monitoring.
 * 
 * @author ESP32_SIH Development Team
 * @version 1.0.0
 * @date December 2025
 * 
 * @copyright MIT License
 */
#if defined(ESP32)

#include "ESP32_SIH.h"

// WiFiScanResult implementation (unchanged)
bool WiFiScanResult::isOpen() const {
    return encryptionType == WIFI_AUTH_OPEN;
}

// NetworkCredential implementation (unchanged)
NetworkCredential::NetworkCredential() {
    memset(ssid, 0, sizeof(ssid));
    memset(password, 0, sizeof(password));
    isValid = false;
    lastConnected = 0;
    connectionAttempts = 0;
    successfulConnections = 0;
}

void NetworkCredential::set(const String& ssidStr, const String& passwordStr) {
    ssidStr.toCharArray(ssid, SSID_MAX_LENGTH + 1);
    passwordStr.toCharArray(password, PASSWORD_MAX_LENGTH + 1);
    isValid = true;
}

String NetworkCredential::getSSID() const {
    return String(ssid);
}

String NetworkCredential::getPassword() const {
    return String(password);
}

// NVSStorage implementation (replaces EEPROMStorage)
NVSStorage::NVSStorage() : _initialized(false), _networkCount(0) {}

bool NVSStorage::begin() {
    if (_initialized) return true;
    
    bool success = _prefs.begin(NVS_NAMESPACE, false);
    if (!success) {
        Serial.println("NVS init failed, attempting reset");
        _prefs.end();
        delay(100);
        success = _prefs.begin(NVS_NAMESPACE, true); // Read-only mode
        if (!success) {
            Serial.println("NVS reset failed, creating new namespace");
            _prefs.begin(NVS_NAMESPACE, false);
        }
    }
    
    loadHeader();
    loadNetworks();
    _initialized = true;
    return true;
}

void NVSStorage::loadHeader() {
    _networkCount = _prefs.getUChar("network_count", 0);
    if (_networkCount > MAX_NETWORKS) {
        _networkCount = 0;
        clearAllNetworks();
    }
}

void NVSStorage::saveHeader() {
    _prefs.putUChar("network_count", _networkCount);
}

void NVSStorage::loadNetworks() {
    for (uint8_t i = 0; i < _networkCount && i < MAX_NETWORKS; i++) {
        char key[20];
        snprintf(key, sizeof(key), "network_%d", i);
        size_t size = sizeof(NetworkCredential);
        if (_prefs.getBytes(key, &_networks[i], size) != size) {
            memset(&_networks[i], 0, size);
        }
    }
}

void NVSStorage::saveNetworks() {
    for (uint8_t i = 0; i < _networkCount && i < MAX_NETWORKS; i++) {
        char key[20];
        snprintf(key, sizeof(key), "network_%d", i);
        _prefs.putBytes(key, &_networks[i], sizeof(NetworkCredential));
    }
    saveHeader();
}

int NVSStorage::findNetworkIndex(const String& ssid) const {
    for (uint8_t i = 0; i < _networkCount; i++) {
        if (_networks[i].isValid && ssid.equals(_networks[i].getSSID())) {
            return i;
        }
    }
    return -1;
}

void NVSStorage::removeLeastSuccessfulNetwork() {
    if (_networkCount == 0) return;
    
    uint8_t leastSuccessfulIndex = 0;
    uint32_t minSuccess = _networks[0].successfulConnections;
    
    for (uint8_t i = 1; i < _networkCount; i++) {
        if (_networks[i].successfulConnections < minSuccess) {
            minSuccess = _networks[i].successfulConnections;
            leastSuccessfulIndex = i;
        }
    }
    
    // Shift remaining networks down
    for (uint8_t i = leastSuccessfulIndex; i < _networkCount - 1; i++) {
        _networks[i] = _networks[i + 1];
    }
    
    _networkCount--;
    memset(&_networks[_networkCount], 0, sizeof(NetworkCredential));
}

bool NVSStorage::saveNetwork(const String& ssid, const String& password) {
    if (!_initialized) return false;
    
    // Check if network already exists
    int index = findNetworkIndex(ssid);
    if (index >= 0) {
        // Update existing network
        _networks[index].set(ssid, password);
        _networks[index].connectionAttempts = 0;
        _networks[index].successfulConnections++;
        _networks[index].lastConnected = millis();
    } else {
        // Add new network
        if (_networkCount >= MAX_NETWORKS) {
            // Remove least successful network
            removeLeastSuccessfulNetwork();
        }
        index = _networkCount++;
        _networks[index].set(ssid, password);
        _networks[index].connectionAttempts = 0;
        _networks[index].successfulConnections = 1;
        _networks[index].lastConnected = millis();
    }
    
    saveNetworks();
    return true;
}

bool NVSStorage::getNetwork(const String& ssid, NetworkCredential& credential) {
    if (!_initialized) return false;
    int index = findNetworkIndex(ssid);
    if (index >= 0) {
        credential = _networks[index];
        return true;
    }
    return false;
}

bool NVSStorage::removeNetwork(const String& ssid) {
    if (!_initialized) return false;
    int index = findNetworkIndex(ssid);
    if (index < 0) return false;
    
    // Shift remaining networks down
    for (uint8_t i = index; i < _networkCount - 1; i++) {
        _networks[i] = _networks[i + 1];
    }
    
    _networkCount--;
    memset(&_networks[_networkCount], 0, sizeof(NetworkCredential));
    saveNetworks();
    return true;
}

void NVSStorage::clearAllNetworks() {
    if (!_initialized) return;
    
    // Clear all network entries
    for (uint8_t i = 0; i < MAX_NETWORKS; i++) {
        char key[20];
        snprintf(key, sizeof(key), "network_%d", i);
        _prefs.remove(key);
    }
    
    _networkCount = 0;
    memset(_networks, 0, sizeof(_networks));
    saveHeader();
}

std::vector<NetworkCredential> NVSStorage::getAllNetworks() const {
    std::vector<NetworkCredential> result;
    for (uint8_t i = 0; i < _networkCount; i++) {
        if (_networks[i].isValid) {
            result.push_back(_networks[i]);
        }
    }
    return result;
}

size_t NVSStorage::getNetworkCount() const {
    return _networkCount;
}

void NVSStorage::incrementConnectionAttempts(const String& ssid) {
    int index = findNetworkIndex(ssid);
    if (index >= 0) {
        _networks[index].connectionAttempts++;
        _networks[index].lastConnected = millis();
        saveNetworks();
    }
}

void NVSStorage::markConnectionSuccessful(const String& ssid) {
    int index = findNetworkIndex(ssid);
    if (index >= 0) {
        _networks[index].successfulConnections++;
        _networks[index].lastConnected = millis();
        saveNetworks();
    }
}

// CommandHandler Implementation (unchanged)
bool CommandHandler::registerCommand(const String& command,
                                     CommandCallback callback,
                                     const String& description,
                                     const String& usage,
                                     const String& category) {
    CommandInfo info{description, usage, category};
    _commands[command] = std::make_pair(callback, info);
    return true;
}

bool CommandHandler::executeCommand(const String& commandLine) {
    if (commandLine.isEmpty()) return false;
    
    std::vector<String> args;
    int start = 0;
    int end = commandLine.indexOf(' ');
    
    while (end != -1) {
        String arg = commandLine.substring(start, end);
        if (arg.length() > 0) args.push_back(arg);
        start = end + 1;
        end = commandLine.indexOf(' ', start);
    }
    String lastArg = commandLine.substring(start);
    if (lastArg.length() > 0) args.push_back(lastArg);
    
    if (args.empty()) return false;
    
    String command = args[0];
    args.erase(args.begin());
    
    auto it = _commands.find(command);
    if (it != _commands.end()) {
        it->second.first(args);
        return true;
    }
    
