voltvirtuoso/SerialInterfaceHandler/src/ESP32_SIH.cpp
    Serial.printf("Unknown command: %s\n", command.c_str());
    Serial.println("Type 'help' for available commands");
    return false;
}

String CommandHandler::getCommandHelp(const String& command) const {
    auto it = _commands.find(command);
    if (it != _commands.end()) {
        const auto& info = it->second.second;
        String help = "Command: " + command + "\n";
        help += "Description: " + info.description + "\n";
        help += "Usage: " + info.usage + "\n";
        help += "Category: " + info.category + "\n";
        return help;
    }
    return "";
}

std::vector<String> CommandHandler::getCategories() const {
    std::vector<String> categories;
    for (const auto& pair : _commands) {
        const String& category = pair.second.second.category;
        bool found = false;
        for (const auto& existing : categories) {
            if (existing == category) {
                found = true;
                break;
            }
        }
        if (!found) {
            categories.push_back(category);
        }
    }
    return categories;
}

std::vector<String> CommandHandler::getAvailableCommands(const String& category) const {
    std::vector<String> commands;
    for (const auto& pair : _commands) {
        if (category.isEmpty() || pair.second.second.category == category) {
            commands.push_back(pair.first);
        }
    }
    return commands;
}

// HelpSystem Implementation
HelpSystem::HelpSystem(CommandHandler* commandHandler, HardwareSerial* serial)
    : _commandHandler(commandHandler), _serial(serial) {}

void HelpSystem::showHelp(const String& command) {
    if (command.isEmpty()) {
        _serial->println("\n=== ESP8266 Serial Interface System Help ===");
        _serial->println("Available commands:");
        
        auto categories = getHelpCategories();
        for (const auto& category : categories) {
            _serial->printf("\n--- %s Commands ---\n", category.c_str());
            auto commands = _commandHandler->getAvailableCommands(category);
            for (const auto& cmd : commands) {
                String help = _commandHandler->getCommandHelp(cmd);
                if (!help.isEmpty()) {
                    _serial->println(help.substring(0, help.indexOf('\n')));
                }
            }
        }
        
        _serial->println("\nUsage:");
        _serial->println("  help <command>    - Show help for specific command");
        _serial->println("  help <category>   - Show commands in category");
        _serial->println("  ?                 - Quick help summary");
        _serial->println("  menu              - Access interactive menus");
        _serial->println("  status            - Show system status");
    } else {
        String help = _commandHandler->getCommandHelp(command);
        if (!help.isEmpty()) {
            _serial->println("\n=== Command Help: " + command + " ===");
            _serial->println(help);
            return;
        }
        
        auto categories = getHelpCategories();
        for (const auto& category : categories) {
            if (category.equalsIgnoreCase(command)) {
                showCategoryHelp(command);
                return;
            }
        }
        
        _serial->println("Command or category not found: " + command);
        _serial->println("Type 'help' for list of available commands and categories");
    }
}

void HelpSystem::showQuickHelp() {
    _serial->println("\n=== Quick Help Summary ===");
    _serial->println("?        - Show this quick help");
    _serial->println("help     - Show detailed help system");
    _serial->println("menu     - Access configuration menus");
    _serial->println("status   - Show system status");
    _serial->println("wifi     - WiFi management commands");
    _serial->println("creds    - Manage stored credentials");
}

void HelpSystem::showCategoryHelp(const String& category) {
    _serial->println("\n=== Help Category: " + category + " ===");
    
    auto commands = _commandHandler->getAvailableCommands(category);
    if (commands.empty()) {
        _serial->println("No commands found in category: " + category);
        return;
    }
    
    for (const auto& cmd : commands) {
        String help = _commandHandler->getCommandHelp(cmd);
        if (!help.isEmpty()) {
            _serial->println(help);
        }
    }
}

std::vector<String> HelpSystem::getHelpCategories() const {
    return _commandHandler->getCategories();
}

bool WiFiManager::scanNetworks(std::vector<WiFiScanResult>& results) {
    int n = WiFi.scanNetworks();
    if (n <= 0) {
        results.clear();
        return n == 0; // true if no networks found, false if scan failed
    }
    results.reserve(n);
    for (int i = 0; i < n; i++) {
        WiFiScanResult result;
        result.ssid = WiFi.SSID(i);
        result.rssi = WiFi.RSSI(i);
        result.encryptionType = WiFi.encryptionType(i);
        result.isHidden = false; // ESP32 doesn't provide hidden network info
        results.push_back(result);
    }
    return true;
}

bool WiFiManager::connect(const String& ssid, const String& password, bool saveCredentials) {
    // Ensure WiFi is properly set up
    setupWiFi();
    
    Serial.printf("Attempting to connect to: %s\n", ssid.c_str());
    _storage.incrementConnectionAttempts(ssid);
    
    WiFi.begin(ssid.c_str(), password.c_str());
    
    unsigned long startTime = millis();
    while (millis() - startTime < 15000) { // 15 second timeout
        int status = WiFi.status();
        if (status == WL_CONNECTED) {
            _connected = true;
            _connectedSSID = ssid;
            
            // Only save credentials if connection is successful
            if (saveCredentials) {
                _storage.saveNetwork(ssid, password);
                _storage.markConnectionSuccessful(ssid);
            }
            
            Serial.printf("✓ Connected to %s successfully\n", ssid.c_str());
            Serial.printf("IP Address: %s\n", WiFi.localIP().toString().c_str());
            return true;
        }
        delay(200);
    }
    
    _connected = false;
    Serial.printf("✗ Failed to connect to %s (status: %d)\n", ssid.c_str(), WiFi.status());
    return false;
}

void WiFiManager::disconnect() {
    WiFi.disconnect();
    delay(100);
    _connected = false;
    _connectedSSID = "";
}

bool WiFiManager::autoConnect() {
    if (!_storage.begin()) {
        Serial.println("EEPROM storage not initialized");
        return false;
    }
    
    auto networks = _storage.getAllNetworks();
    if (networks.empty()) {
        Serial.println("No saved WiFi credentials found");
        return false;
    }
    
