voltvirtuoso/SerialInterfaceHandler/src/ESP32_SIH.cpp
    // Sort networks by priority (successful connections, last connected time)
    sortNetworksByPriority(networks);
    
    Serial.println("Attempting auto-connect to stored networks...");
    
    for (const auto& network : networks) {
        if (!network.isValid) continue;
        
        String ssid = network.getSSID();
        String password = network.getPassword();
        
        Serial.printf("Trying network: %s\n", ssid.c_str());
        
        if (connect(ssid, password, false)) {
            return true;
        }
    }
    
    Serial.println("All auto-connect attempts failed");
    return false;
}

void WiFiManager::sortNetworksByPriority(std::vector<NetworkCredential>& networks) {
    std::sort(networks.begin(), networks.end(), 
        [](const NetworkCredential& a, const NetworkCredential& b) {
            // Primary: successful connections
            if (a.successfulConnections != b.successfulConnections) {
                return a.successfulConnections > b.successfulConnections;
            }
            // Secondary: last connected time (more recent first)
            return a.lastConnected > b.lastConnected;
        });
}

bool WiFiManager::verifyConnection() {
    if (!_connected) return false;
    return WiFi.status() == WL_CONNECTED;
}

bool WiFiManager::clearAllCredentials() {
    _storage.clearAllNetworks();
    WiFi.disconnect();
    delay(100);
    _connected = false;
    _connectedSSID = "";
    Serial.println("✓ All WiFi credentials cleared successfully");
    return true;
}

std::vector<NetworkCredential> WiFiManager::listStoredCredentials() const {
    return _storage.getAllNetworks();
}

bool WiFiManager::removeCredential(const String& ssid) {
    return _storage.removeNetwork(ssid);
}

WiFiManager::ConnectionStatus WiFiManager::getStatus() const {
    ConnectionStatus status;
    status.connected = _connected && (WiFi.status() == WL_CONNECTED);
    status.ssid = _connectedSSID;
    status.ip = status.connected ? WiFi.localIP().toString() : "0.0.0.0";
    status.rssi = status.connected ? WiFi.RSSI() : 0;
    return status;
}

bool WiFiManager::isStorageInitialized() {
    return _storage.begin();
}

// MenuSystem Implementation
MenuSystem::MenuSystem(HardwareSerial* serial, CommandHandler* commandHandler,
                     WiFiManager* wifiManager)
    : _serial(serial), _commandHandler(commandHandler), 
      _wifiManager(wifiManager), _currentMenu(MAIN), _inMenuMode(false),
      _lastActivity(0), _menuTimeout(60000) {
    initializeMenus();
}

void MenuSystem::initializeMenus() {
    _mainMenuItems = {
        {1, "WiFi Configuration", [this]() { showMenu(WIFI); }, "Configure WiFi networks", true},
        {2, "Credentials Management", [this]() { showMenu(CREDENTIALS); }, "Manage stored networks", true},
        {3, "System Status", [this]() { showSystemStatus(); }, "Show system information", true},
        {4, "Exit Menu", [this]() { exitMenu(); }, "Return to command mode", true}
    };
    
    _wifiMenuItems = {
        {1, "Scan Networks", [this]() { scanNetworks(); }, "Scan for available networks", true},
        {2, "Connect to Network", [this]() { connectToNetwork(); }, "Connect to WiFi network", true},
        {3, "Auto Connect", [this]() { 
            _serial->println("Attempting auto-connect to stored networks...");
            if (_wifiManager->autoConnect()) {
                _serial->println("✓ Auto-connect successful!");
            } else {
                _serial->println("✗ Auto-connect failed");
            }
            delay(2000);
            showMenu(WIFI);
        }, "Auto-connect to stored networks", true},
        {4, "Check Connection", [this]() { checkConnection(); }, "Check current WiFi status", true},
        {5, "Back to Main Menu", [this]() { showMenu(MAIN); }, "Return to main menu", true}
    };
    
    _credentialsMenuItems = {
        {1, "List Stored Networks", [this]() { listStoredCredentials(); }, "Show all stored credentials", true},
        {2, "Remove Network", [this]() { removeStoredCredential(); }, "Remove a specific network", true},
        {3, "Clear All Networks", [this]() { clearAllCredentials(); }, "Clear all stored credentials", true},
        {4, "Back to Main Menu", [this]() { showMenu(MAIN); }, "Return to main menu", true}
    };
}

void MenuSystem::showMenu(MenuType type) {
    _currentMenu = type;
    _inMenuMode = true;
    _lastActivity = millis();
    
    clearScreen();
    showHeader(getMenuTitle(type));
    
    std::vector<MenuItem>* items = nullptr;
    switch (type) {
        case MAIN: items = &_mainMenuItems; break;
        case WIFI: items = &_wifiMenuItems; break;
        case CREDENTIALS: items = &_credentialsMenuItems; break;
        default: items = &_mainMenuItems; break;
    }
    
    for (const auto& item : *items) {
        if (item.isEnabled) {
            _serial->printf("%d. %s\n", item.id, item.label.c_str());
            if (!item.description.isEmpty()) {
                _serial->printf("   - %s\n", item.description.c_str());
            }
        }
    }
    
    showFooter();
    _serial->print("\nSelect option (1-" + String(items->size()) + "): ");
}

void MenuSystem::process() {
    if (!_inMenuMode) return;
    
    if (millis() - _lastActivity > _menuTimeout) {
        exitMenu();
        _serial->println("\nMenu timeout. Returned to command mode.");
    }
}

void MenuSystem::handleMenuInput(char inputChar) {
    _lastActivity = millis();
    
    if (inputChar == '0') {
        exitMenu();
        return;
    }
    
    int selection = inputChar - '0';
    if (selection < 1) return;
    
    std::vector<MenuItem>* items = nullptr;
    switch (_currentMenu) {
        case MAIN: items = &_mainMenuItems; break;
        case WIFI: items = &_wifiMenuItems; break;
        case CREDENTIALS: items = &_credentialsMenuItems; break;
        default: items = &_mainMenuItems; break;
    }
    
    if (selection <= static_cast<int>(items->size())) {
        const auto& item = (*items)[selection - 1];
        if (item.isEnabled && item.action) {
            item.action();
        }
    } else {
        _serial->println("Invalid selection");
        delay(500);
        showMenu(_currentMenu);
    }
}

void MenuSystem::exitMenu() {
    _inMenuMode = false;
    _serial->println("\nExited menu mode. Type 'menu' to return or 'help' for commands.");
}

void MenuSystem::setTimeout(unsigned long timeoutMs) {
    _menuTimeout = timeoutMs;
}

void MenuSystem::scanNetworks() {
    clearScreen();
    showHeader("WiFi Network Scan");
    
    std::vector<WiFiScanResult> results;
    if (_wifiManager->scanNetworks(results)) {
        _serial->println("Available networks:");
        _serial->println("================================");
        for (size_t i = 0; i < results.size(); i++) {
            _serial->printf("%d. %-20s RSSI: %-4d %s\n", 
                          i + 1, results[i].ssid.c_str(), results[i].rssi,
                          results[i].isOpen() ? "[OPEN]" : "[SECURED]");
        }
        _serial->println("================================");
        
        if (results.size() > 0) {
            int selection = getNumericInput("\nSelect network to connect to (0 to cancel)", 0, results.size());
            if (selection > 0 && selection <= static_cast<int>(results.size())) {
                connectToNetwork(results[selection - 1].ssid);
            }
        }
    } else {
        _serial->println("Scan failed. Please try again.");
    }
    
    delay(1000);
    showMenu(WIFI);
}

