voltvirtuoso/SerialInterfaceHandler/src/ESP32_SIH.cpp
void MenuSystem::connectToNetwork(const String& presetSSID) {
    clearScreen();
    showHeader("Connect to WiFi Network");
    
    String ssid = presetSSID;
    if (ssid.isEmpty()) {
        ssid = getUserInput("Enter WiFi SSID (or 0 to cancel)");
        if (ssid == "0") {
            showMenu(WIFI);
            return;
        }
    }
    
    // Check if we have saved credentials for this SSID
    NetworkCredential savedCredential;
    if (_wifiManager->isStorageInitialized() && _wifiManager->listStoredCredentials().size() > 0) {
        for (const auto& cred : _wifiManager->listStoredCredentials()) {
            if (cred.getSSID() == ssid) {
                savedCredential = cred;
                break;
            }
        }
    }
    
    String password;
    
    if (!savedCredential.ssid[0]) {
        password = getUserInput("Enter WiFi password (leave blank for open network)", true);
    } else {
        _serial->printf("\nFound saved credentials for %s\n", ssid.c_str());
        _serial->printf("Connection stats: %lu attempts, %lu successful\n", 
                       savedCredential.connectionAttempts, savedCredential.successfulConnections);
        String useSaved = getUserInput("Use saved password? (y/n) [y]", false);
        if (useSaved.isEmpty() || useSaved.equalsIgnoreCase("y")) {
            password = savedCredential.getPassword();
            _serial->println("Using saved password...");
        } else {
            password = getUserInput("Enter WiFi password (leave blank for open network)", true);
        }
    }
    
    _serial->printf("\nConnecting to %s...\n", ssid.c_str());
    
    // Only save credentials if connection succeeds
    if (_wifiManager->connect(ssid, password, true)) {
        _serial->println("✓ Connection successful!");
    } else {
        _serial->println("✗ Connection failed!");
    }
    
    delay(2000);
    showMenu(WIFI);
}

void MenuSystem::checkConnection() {
    clearScreen();
    showHeader("WiFi Connection Status");
    
    auto status = _wifiManager->getStatus();
    
    if (status.connected) {
        _serial->println("✓ Currently connected to WiFi");
        _serial->printf("Network: %s\n", status.ssid.c_str());
        _serial->printf("IP Address: %s\n", status.ip.c_str());
        _serial->printf("Signal Strength: %d dBm\n", status.rssi);
    } else {
        _serial->println("✗ Not connected to WiFi");
        auto networks = _wifiManager->listStoredCredentials();
        if (!networks.empty()) {
            _serial->printf("Stored networks: %d\n", networks.size());
            for (const auto& net : networks) {
                _serial->printf("- %s (%lu successful)\n", net.getSSID().c_str(), net.successfulConnections);
            }
        } else {
            _serial->println("No saved WiFi credentials");
        }
    }
    
    delay(2000);
    showMenu(WIFI);
}

void MenuSystem::listStoredCredentials() {
    clearScreen();
    showHeader("Stored WiFi Credentials");
    
    auto networks = _wifiManager->listStoredCredentials();
    
    if (networks.empty()) {
        _serial->println("No stored WiFi credentials found");
    } else {
        _serial->printf("Found %d stored networks:\n", networks.size());
        _serial->println("================================");
        
        for (size_t i = 0; i < networks.size(); i++) {
            const auto& net = networks[i];
            _serial->printf("%d. SSID: %s\n", i + 1, net.getSSID().c_str());
            _serial->printf("   Attempts: %lu, Successful: %lu\n", 
                          net.connectionAttempts, net.successfulConnections);
            _serial->printf("   Last connected: %lu ms ago\n", 
                          millis() - net.lastConnected);
            _serial->println("--------------------------------");
        }
    }
    
    delay(3000);
    showMenu(CREDENTIALS);
}

void MenuSystem::removeStoredCredential() {
    clearScreen();
    showHeader("Remove Stored Network");
    
    auto networks = _wifiManager->listStoredCredentials();
    
    if (networks.empty()) {
        _serial->println("No stored credentials to remove");
        delay(1500);
        showMenu(CREDENTIALS);
        return;
    }
    
    _serial->println("Available networks to remove:");
    for (size_t i = 0; i < networks.size(); i++) {
        _serial->printf("%d. %s\n", i + 1, networks[i].getSSID().c_str());
    }
    
    int selection = getNumericInput("\nSelect network to remove (0 to cancel)", 0, networks.size());
    if (selection > 0 && selection <= static_cast<int>(networks.size())) {
        String ssid = networks[selection - 1].getSSID();
        String confirm = getUserInput("Confirm removal of '" + ssid + "'? (y/n)");
        if (confirm.equalsIgnoreCase("y")) {
            if (_wifiManager->removeCredential(ssid)) {
                _serial->println("✓ Network removed successfully");
            } else {
                _serial->println("✗ Failed to remove network");
            }
        } else {
            _serial->println("Operation cancelled");
        }
    }
    
    delay(1500);
    showMenu(CREDENTIALS);
}

void MenuSystem::clearAllCredentials() {
    clearScreen();
    showHeader("Clear All Credentials");
    
    _serial->println("This will remove ALL stored WiFi credentials from EEPROM.");
    _serial->println("You will need to reconfigure WiFi after clearing.");
    
    String confirm = getUserInput("Are you sure? (y/n)");
    if (confirm.equalsIgnoreCase("y")) {
        if (_wifiManager->clearAllCredentials()) {
            _serial->println("✓ All WiFi credentials cleared successfully");
        } else {
            _serial->println("✗ Failed to clear credentials");
        }
    } else {
        _serial->println("Operation cancelled");
    }
    
    delay(1500);
    showMenu(CREDENTIALS);
}

void MenuSystem::showSystemStatus() {
    
    clearScreen();
    showHeader("System Status");
    _serial->printf("System Uptime: %lu seconds\n", millis() / 1000);
    _serial->printf("Free Heap: %u bytes\n", ESP.getFreeHeap());
    _serial->printf("Chip Model: ESP32\n");
    _serial->println("Storage: NVS (Preferences)"); // Fixed line
    _serial->print("MAC Address: ");
    _serial->println(WiFi.macAddress());
    
    auto wifiStatus = _wifiManager->getStatus();
    _serial->printf("\nWiFi Status: %s\n", wifiStatus.connected ? "Connected" : "Disconnected");
    if (wifiStatus.connected) {
        _serial->printf("Connected to: %s\n", wifiStatus.ssid.c_str());
        _serial->printf("IP Address: %s\n", wifiStatus.ip.c_str());
        _serial->printf("Signal Strength: %d dBm\n", wifiStatus.rssi);
    }
    
    auto networks = _wifiManager->listStoredCredentials();
    _serial->printf("\nStored Networks: %d\n", networks.size());
    
