voltvirtuoso/SerialInterfaceHandler/src/ESP32_SIH.cpp
    delay(3000);
    showMenu(MAIN);
}

String MenuSystem::getUserInput(const String& prompt, bool isSensitive) {
    _serial->println("\n" + prompt);
    _serial->print("> ");
    
    String input;
    unsigned long lastInput = millis();
    
    while (true) {
        if (_serial->available()) {
            char c = _serial->read();
            if (c == '\n' || c == '\r') {
                if (input.length() > 0) {
                    _serial->println();
                    return input;
                }
            } else if (c == 8 || c == 127) { // Backspace
                if (input.length() > 0) {
                    input.remove(input.length() - 1);
                    _serial->print("\b \b");
                    lastInput = millis();
                }
            } else if (c >= 32 && c <= 126) { // Printable characters
                input += c;
                if (isSensitive) {
                    _serial->print('*');
                } else {
                    _serial->print(c);
                }
                lastInput = millis();
            }
        }
        
        if (millis() - lastInput > 30000) { // 30 second timeout
            _serial->println("\nInput timeout");
            return "";
        }
        
        delay(10);
    }
}

int MenuSystem::getNumericInput(const String& prompt, int minVal, int maxVal) {
    while (true) {
        String input = getUserInput(prompt);
        if (input.isEmpty()) continue;
        
        int value = input.toInt();
        if (value == 0 && input != "0") {
            _serial->println("Invalid number. Please enter a valid number.");
            continue;
        }
        
        if (value < minVal || value > maxVal) {
            _serial->printf("Value must be between %d and %d\n", minVal, maxVal);
            continue;
        }
        
        return value;
    }
}

void MenuSystem::clearScreen() {
	for(uint8_t i=0; i < 5; i++)
		_serial->println();
}

void MenuSystem::showHeader(const String& title) {
    _serial->println("================================");
    _serial->printf("  %s\n", title.c_str());
    _serial->println("================================");
}

void MenuSystem::showFooter() {
    _serial->println("================================");
    _serial->printf("  Timeout: %lu seconds\n", (_menuTimeout - (millis() - _lastActivity)) / 1000);
    _serial->println("  Press '0' to exit menu");
    _serial->println("================================");
}

String MenuSystem::getMenuTitle(MenuType type) const {
    switch (type) {
        case MAIN: return "Main Menu";
        case WIFI: return "WiFi Configuration";
        case SYSTEM: return "System Management";
        case CREDENTIALS: return "Credentials Management";
        default: return "Menu";
    }
}

bool MenuSystem::isInMenu() const {
    return _inMenuMode;
}


// Add this to WiFiManager class implementation
void WiFiManager::setupWiFi() {
    WiFi.mode(WIFI_STA);
    WiFi.setTxPower(WIFI_POWER_19_5dBm); // Optimal power for ESP32
    WiFi.setHostname("ESP32-SIH");
    WiFi.setAutoReconnect(true);
    // WiFi.setAutoConnect(true);
    WiFi.disconnect();
    delay(100);
}

WiFiManager::WiFiManager() : _connected(false), _lastReconnectAttempt(0) {}

bool WiFiManager::begin() {
    if (!_storage.begin()) {
        return false;
    }
    // Setup WiFi hardware properly
    setupWiFi();
    return true;
}

// ESP32_SIH Implementation
ESP32_SIH::ESP32_SIH(HardwareSerial* serial)
    : _serial(serial), _helpSystem(&_commandHandler, serial),
      _menuSystem(serial, &_commandHandler, &_wifiManager),
      _lastActivity(0), _timeout(30000), _initialized(false),
      _lastReconnectCheck(0), _lastWatchdogCheck(0) {}

bool ESP32_SIH::begin(uint32_t baudRate) {
    _serial->begin(baudRate);
    delay(100);
    
    if (!_wifiManager.begin()) {
        _serial->println("WiFiManager initialization failed");
        return false;
    }
    
    // Attempt auto-reconnect immediately after initialization
    autoReconnectWiFi();
    
    // Register default commands
    registerCommand("help", [this](const std::vector<String>& args) {
        if (args.size() > 0) {
            _helpSystem.showHelp(args[0]);
        } else {
            _helpSystem.showHelp();
        }
    }, "Show help information", "help [command]", "system");
    
    registerCommand("?", [this](const std::vector<String>& args) {
        _helpSystem.showQuickHelp();
    }, "Show quick help summary", "?", "system");
    
    registerCommand("menu", [this](const std::vector<String>& args) {
        _menuSystem.showMenu(MenuSystem::MAIN);
    }, "Show main menu", "menu", "system");
    
    registerCommand("status", [this](const std::vector<String>& args) {
        auto wifiStatus = _wifiManager.getStatus();
        _serial->printf("System Uptime: %lu seconds\n", millis() / 1000);
        _serial->printf("Free Heap: %u bytes\n", ESP.getFreeHeap());
        _serial->printf("Chip Model: ESP32\n");
        _serial->printf("NVS Storage: wifi_creds namespace\n");
        _serial->printf("WiFi Status: %s\n", wifiStatus.connected ? "Connected" : "Disconnected");
        _serial->print("MAC Address: ");
        _serial->println(WiFi.macAddress());
        if (wifiStatus.connected) {
            _serial->printf("Connected to: %s\n", wifiStatus.ssid.c_str());
            _serial->printf("IP Address: %s\n", wifiStatus.ip.c_str());
            _serial->printf("Signal Strength: %d dBm\n", wifiStatus.rssi);
            _serial->printf("WiFi Channel: %d\n", WiFi.channel());
        }
        
        auto networks = _wifiManager.listStoredCredentials();
        _serial->printf("\nStored Networks: %d\n", networks.size());
        for (const auto& net : networks) {
            _serial->printf("- %s (Success: %lu)\n", net.getSSID().c_str(), net.successfulConnections);
        }
    }, "Show system status", "status", "system");
    
    registerCommand("wifi", [this](const std::vector<String>& args) {
        if (args.size() > 0) {
            if (args[0] == "scan") {
                std::vector<WiFiScanResult> results;
                if (_wifiManager.scanNetworks(results)) {
                    _serial->println("Available networks:");
                    for (size_t i = 0; i < results.size(); i++) {
                        _serial->printf("%d. %s (RSSI: %d, %s)\n", i + 1, 
                                      results[i].ssid.c_str(), results[i].rssi,
                                      results[i].isOpen() ? "Open" : "Secured");
                    }
                } else {
                    _serial->println("Scan failed");
                }
            } else if (args[0] == "connect" && args.size() > 1) {
                String ssid = args[1];
                String password = (args.size() > 2) ? args[2] : "";
                if (_wifiManager.connect(ssid, password, true)) {
                    _serial->println("Connected successfully");
                } else {
                    _serial->println("Connection failed");
                }
            } else if (args[0] == "status") {
                auto status = _wifiManager.getStatus();
                _serial->printf("WiFi Status: %s\n", status.connected ? "Connected" : "Disconnected");
                if (status.connected) {
                    _serial->printf("Connected to: %s\n", status.ssid.c_str());
                    _serial->printf("IP: %s\n", status.ip.c_str());
                    _serial->printf("RSSI: %d dBm\n", status.rssi);
                }
            } else if (args[0] == "auto") {
                if (_wifiManager.autoConnect()) {
                    _serial->println("Auto-connect successful");
                } else {
                    _serial->println("Auto-connect failed");
                }
            } else if (args[0] == "disconnect") {
                _wifiManager.disconnect(); // Use the proper disconnect method
                _serial->println("Disconnected from WiFi");
            }
        } else {
            _serial->println("WiFi commands: scan, connect <ssid> <password>, status, auto, disconnect");
        }
    }, "WiFi management commands", "wifi <command>", "wifi");
    
