voltvirtuoso/SerialInterfaceHandler/src/ESP32_SIH.cpp
    registerCommand("creds", [this](const std::vector<String>& args) {
        if (args.size() > 0) {
            if (args[0] == "list") {
                auto networks = _wifiManager.listStoredCredentials();
                if (networks.empty()) {
                    _serial->println("No stored credentials");
                } else {
                    _serial->printf("Stored networks (%d):\n", networks.size());
                    for (size_t i = 0; i < networks.size(); i++) {
                        const auto& net = networks[i];
                        _serial->printf("%d. %s\n", i + 1, net.getSSID().c_str());
                        _serial->printf("   Success: %lu, Attempts: %lu\n", 
                                      net.successfulConnections, net.connectionAttempts);
                        _serial->printf("   Last connected: %lu ms ago\n",
                                      millis() - net.lastConnected);
                    }
                }
            } else if (args[0] == "remove" && args.size() > 1) {
                if (_wifiManager.removeCredential(args[1])) {
                    _serial->println("✓ Network removed");
                } else {
                    _serial->println("✗ Network not found");
                }
            } else if (args[0] == "clear") {
                if (_wifiManager.clearAllCredentials()) {
                    _serial->println("✓ All credentials cleared");
                }
            } else if (args[0] == "stats") {
                _serial->println("NVS Storage Statistics:");
                // ESP32-specific NVS stats
                _serial->printf("Namespace: %s\n", NVS_NAMESPACE);
            }
        } else {
            _serial->println("Credentials commands: list, remove <ssid>, clear, stats");
        }
    }, "Manage stored credentials", "creds <command>", "wifi");
    
    registerCommand("reconnect", [this](const std::vector<String>& args) {
        _serial->println("Attempting to reconnect to stored networks...");
        autoReconnectWiFi();
        auto status = _wifiManager.getStatus();
        if (status.connected) {
            _serial->printf("✓ Reconnected to %s\n", status.ssid.c_str());
            _serial->printf("IP: %s\n", status.ip.c_str());
            _serial->printf("RSSI: %d dBm\n", status.rssi);
        } else {
            _serial->println("✗ Reconnection failed");
            _serial->println("Type 'menu' to configure WiFi manually");
            _serial->printf("Available stored networks: %d\n", _wifiManager.listStoredCredentials().size());
        }
    }, "Reconnect to stored networks", "reconnect", "system");
    
    registerCommand("system", [this](const std::vector<String>& args) {
        if (args.size() > 0) {
            if (args[0] == "info") {
                _serial->printf("ESP32 Chip ID: %04X%08X\n", 
                            (uint16_t)(ESP.getEfuseMac() >> 32), 
                            (uint32_t)ESP.getEfuseMac());
                _serial->printf("Flash Size: %u MB\n", ESP.getFlashChipSize() / (1024 * 1024));
                _serial->printf("PSRAM: %s\n", ESP.getPsramSize() > 0 ? "Available" : "Not available");
                _serial->printf("Cores: 2 (WiFi on core %d)\n", xPortGetCoreID());
            } else if (args[0] == "reset") {
                _serial->println("System reset initiated...");
                delay(500);
                ESP.restart();
            }
        } else {
            _serial->println("System commands: info, reset");
        }
    }, "System management commands", "system <command>", "system");
    
    _initialized = true;
    _lastActivity = millis();
    _lastReconnectCheck = millis();
    _lastWatchdogCheck = millis();
    
    _serial->println("\nESP32 Serial Interface System initialized");
    _serial->println("Type 'help' for available commands");
    _serial->println("Type 'menu' to access configuration menu");
    
    // Show connection status after initialization
    auto status = _wifiManager.getStatus();
    if (status.connected) {
        _serial->printf("\n✓ Connected to: %s\n", status.ssid.c_str());
        _serial->printf("IP Address: %s\n", status.ip.c_str());
        _serial->printf("Signal Strength: %d dBm\n", status.rssi);
    } else {
        _serial->println("\n✗ No active WiFi connection");
        _serial->println("Type 'menu' to configure WiFi");
        _serial->printf("Stored networks: %d\n", _wifiManager.listStoredCredentials().size());
        
        // ESP32-specific: Scan for networks on startup if not connected
        if (_wifiManager.listStoredCredentials().empty()) {
            _serial->println("No saved networks found. Scanning for available networks...");
            std::vector<WiFiScanResult> results;
            if (_wifiManager.scanNetworks(results) && !results.empty()) {
                _serial->println("Available networks:");
                for (size_t i = 0; i < results.size() && i < 5; i++) {
                    _serial->printf("%d. %s (RSSI: %d, %s)\n", i + 1,
                                  results[i].ssid.c_str(), results[i].rssi,
                                  results[i].isOpen() ? "Open" : "Secured");
                }
                if (results.size() > 5) {
                    _serial->printf("... and %d more networks\n", results.size() - 5);
                }
            }
        }
    }
    
    return true;
}

void ESP32_SIH::autoReconnectWiFi() {
    auto status = _wifiManager.getStatus();
    
    // Only attempt reconnection if not currently connected
    if (!status.connected) {
        Serial.println("Attempting auto-reconnection...");
        bool success = _wifiManager.autoConnect();
        
        if (success) {
            status = _wifiManager.getStatus();
            Serial.printf("✓ Auto-reconnection successful to: %s\n", status.ssid.c_str());
            Serial.printf("IP: %s\n", status.ip.c_str());
            Serial.printf("RSSI: %d dBm\n", status.rssi);
        } else {
            Serial.println("✗ Auto-reconnection failed");
            
            // ESP32-specific: Try to scan for networks if auto-connect fails
            Serial.println("Scanning for available networks...");
            std::vector<WiFiScanResult> results;
            if (_wifiManager.scanNetworks(results)) {
                Serial.printf("Found %d networks\n", results.size());
            }
        }
    }
}

void ESP32_SIH::process() {
    if (!_initialized) return;
    
