voltvirtuoso/SerialInterfaceHandler/src/ESP32_SIH.cpp
    // Periodically check and attempt reconnection if disconnected
    if (millis() - _lastReconnectCheck > 30000) { // Check every 30 seconds
        _lastReconnectCheck = millis();
        auto status = _wifiManager.getStatus();
        if (!status.connected) {
            Serial.println("Connection lost, attempting reconnection...");
            autoReconnectWiFi();
        }
    }
    
    // Watchdog protection - ensure WiFi stays connected
    if (millis() - _lastWatchdogCheck > 60000) { // Every 60 seconds
        _lastWatchdogCheck = millis();
        auto status = _wifiManager.getStatus();
        if (!status.connected) {
            Serial.println("Watchdog: Connection lost, forcing reconnection...");
            autoReconnectWiFi();
        }
    }
    
    // ESP32-specific: Monitor WiFi events
    if (WiFi.status() != WL_CONNECTED && millis() - _lastReconnectCheck > 5000) {
        // If we've been disconnected for more than 5 seconds, trigger reconnection check
        _lastReconnectCheck = millis() - 25000; // Force reconnection check soon
    }
    
    if (_serial->available()) {
        static String inputLine;
        while (_serial->available()) {
            char c = _serial->read();
            if (c == '\n' || c == '\r') {
                if (inputLine.length() > 0) {
                    _lastActivity = millis();
                    
                    if (_menuSystem.isInMenu() && inputLine.length() == 1) {
                        _menuSystem.handleMenuInput(inputLine[0]);
                    } else {
                        _commandHandler.executeCommand(inputLine);
                    }
                    
                    inputLine = "";
                }
            } else if (c == 8 || c == 127) { // Backspace
                if (inputLine.length() > 0) {
                    inputLine.remove(inputLine.length() - 1);
                    _serial->print("\b \b");
                }
            } else if (c >= 32 && c <= 126) { // Printable characters
                inputLine += c;
                _serial->print(c);
            }
        }
    }
    
    _menuSystem.process();
    
    if (millis() - _lastActivity > _timeout && _menuSystem.isInMenu()) {
        _menuSystem.exitMenu();
        _serial->println("\nInactivity timeout. Returned to command mode.");
    }
}

void ESP32_SIH::registerCommand(const String& command, 
                             CommandHandler::CommandCallback handler,
                             const String& description,
                             const String& usage,
                             const String& category) {
    _commandHandler.registerCommand(command, handler, description, usage, category);
}

void ESP32_SIH::setTimeout(unsigned long timeoutMs) {
    _timeout = timeoutMs;
    _menuSystem.setTimeout(timeoutMs);
}

bool ESP32_SIH::isConnected() const {
    auto status = _wifiManager.getStatus();
    return status.connected;
}

String ESP32_SIH::getConnectedSSID() const {
    auto status = _wifiManager.getStatus();
    return status.ssid;
}

#endif 